exampleCases/example.uniformInflow.ALM/system/sampling/temporalAveraging
      temporalAverage
      {
          //Type of functionObject
          type                 temporalAveraging;

          // Where to load it from
          functionObjectLibs   ("libSOWFAfieldFunctionObjects.so");

          // Function object enabled flag
          enabled              true;

          // When to output the average fields
          outputControl        outputTime;

          //Fields to be averaged - runTime modifiable
          fields
          (
              U
              {
                  mean          on;
                  prime2Mean    on;
                  primeUPrimeMean on;
                  base          time;
              }

              T
              {
                  mean          on;
                  prime2Mean    on;
                  primeUPrimeMean on;
                  base          time;
              }

              p_rgh
              {
                  mean          on;
                  prime2Mean    on;
                  primeUPrimeMean on;
                  base          time;
              }
          );
      }
